{ "projects" : [
    {
      "name": "Randomizer",
      "image": "/randomizer-4.png",
      "content": [
        "A tiny Python library that simplifies random selection from lists and groups.",
        "This is functionality I use a lot for one-off projects -- this library is to save me from having to rewrite the same logic over and over.",
        "Though the code is brief, the README does demonstrate my passion for clear documentation."
      ],
      "codeUrl": "https://github.com/jessypeck/randomizer"
    },
    {
      "name": "Random Sundry",
      "image": "/random-3.png",
      "content": [
        "A robust fullstack webapp that generates items and ideas for tabletop roleplaying games like Dungeons and Dragons.",
        "Users can make accounts that let them 'like' generator results and review their favorites.",
        "This project was my first real experiment with backend programming."
      ],
      "siteUrl": "https://random-sundry.herokuapp.com/",
      "codeUrl": "https://github.com/jessypeck/random-sundry"
    },
    {
      "name": "Piano Says",
      "image": "/piano.png",
      "content": [
        "A Simon-like memory game in the style of a piano.",
        "Players can choose which key they want the randomized \"song\" to play in.",
        "An optional \"strict\" mode ends the game when the wrong button is pressed.",
        "This project was my first experience with ES6 classes."
      ],
      "siteUrl": "https://piano-says.netlify.com",
      "codeUrl": "https://github.com/jessypeck/piano-says"
    },
    {
      "name": "Minuteur",
      "image": "/minuteur.png",
      "content": [
        "A pomodoro timer for helping me remember to take breaks.",
        "The timer can be paused, reset, and stopped.",
        "The user can customize the lengths for focus and break periods.",
        "One of my earlier projects from when I was first learning Javascript."
      ],
      "siteUrl": "https://minuteur.netlify.com/",
      "codeUrl": "https://github.com/jessypeck/minuteur"
    }
  ]
}